<a href="https://colab.research.google.com/github/umsi-data-science/si370/blob/master/SI%20370%3A%20Day%202%3A%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({"a": [1,2,3],
                   "b": [4,5,6],
                   "c": [7,8,9]})

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [4]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [5]:
df.a

0    1
1    2
2    3
Name: a, dtype: int64

In [6]:
df.a.values

array([1, 2, 3])

In [7]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df + 1

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [9]:
df.a + 1

0    2
1    3
2    4
Name: a, dtype: int64

In [0]:
df['d'] = df['a'] + 1

In [11]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4

In [12]:
df.describe()

         a    b    c    d
count  3.0  3.0  3.0  3.0
mean   2.0  5.0  8.0  3.0
std    1.0  1.0  1.0  1.0
min    1.0  4.0  7.0  2.0
25%    1.5  4.5  7.5  2.5
50%    2.0  5.0  8.0  3.0
75%    2.5  5.5  8.5  3.5
max    3.0  6.0  9.0  4.0

In [13]:
df.apply(np.mean,axis=0)

a    2.0
b    5.0
c    8.0
d    3.0
dtype: float64

In [14]:
 df.apply(np.mean,axis=1)

0    3.5
1    4.5
2    5.5
dtype: float64

In [0]:
df['e'] = ["one","two","three"]
df['f'] = [1.0,5.0,9.0]

In [16]:
df

   a  b  c  d      e    f
0  1  4  7  2    one  1.0
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [17]:
df.dtypes

a      int64
b      int64
c      int64
d      int64
e     object
f    float64
dtype: object

In [18]:
df.select_dtypes(include=['int','float'])

   a  b  c  d    f
0  1  4  7  2  1.0
1  2  5  8  3  5.0
2  3  6  9  4  9.0

## Exercise X
Use .describe() to gather descriptive statistics on all the columns in the df DataFrame

In [19]:
# Solution
df.describe(include='all')

          a    b    c    d      e    f
count   3.0  3.0  3.0  3.0      3  3.0
unique  NaN  NaN  NaN  NaN      3  NaN
top     NaN  NaN  NaN  NaN  three  NaN
freq    NaN  NaN  NaN  NaN      1  NaN
mean    2.0  5.0  8.0  3.0    NaN  5.0
std     1.0  1.0  1.0  1.0    NaN  4.0
min     1.0  4.0  7.0  2.0    NaN  1.0
25%     1.5  4.5  7.5  2.5    NaN  3.0
50%     2.0  5.0  8.0  3.0    NaN  5.0
75%     2.5  5.5  8.5  3.5    NaN  7.0
max     3.0  6.0  9.0  4.0    NaN  9.0

In [0]:
df_missing = pd.DataFrame(
    {'a':[1,2,3,np.NaN],
     'b':[2,3,np.NaN,5]})

In [21]:
df_missing

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [22]:
df_missing.dropna()

     a    b
0  1.0  2.0
1  2.0  3.0

In [23]:
df_missing.dropna(subset=['a'])

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN

In [24]:
df_missing.fillna(0)

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  0.0
3  0.0  5.0

In [25]:
df_missing.fillna(df.mean())

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  5.0
3  2.0  5.0

In [26]:
df_missing.fillna(method='ffill')

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  3.0
3  3.0  5.0

In [27]:
df_missing.fillna(method='bfill')

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  5.0
3  NaN  5.0

In [28]:
df

   a  b  c  d      e    f
0  1  4  7  2    one  1.0
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [30]:
df.set_index('e')

       a  b  c  d    f
e
one    1  4  7  2  1.0
two    2  5  8  3  5.0
three  3  6  9  4  9.0

In [31]:
df.reset_index()

   index  a  b  c  d      e    f
0      0  1  4  7  2    one  1.0
1      1  2  5  8  3    two  5.0
2      2  3  6  9  4  three  9.0

In [32]:
df # note that we have the original dataframe

   a  b  c  d      e    f
0  1  4  7  2    one  1.0
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [35]:
df.iloc[1]

a      2
b      5
c      8
d      3
e    two
f      5
Name: 1, dtype: object

In [36]:
df.iloc[1:3]

   a  b  c  d      e    f
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [0]:
df = df.set_index('e')

In [38]:
df.loc['two']

a    2.0
b    5.0
c    8.0
d    3.0
f    5.0
Name: two, dtype: float64

In [41]:
df[df['a'] > 2]

       a  b  c  d    f
e
three  3  6  9  4  9.0

In [42]:
df.query('a > 2')

       a  b  c  d    f
e
three  3  6  9  4  9.0

In [43]:
df

       a  b  c  d    f
e
one    1  4  7  2  1.0
two    2  5  8  3  5.0
three  3  6  9  4  9.0

In [44]:
df.sort_index()

       a  b  c  d    f
e
one    1  4  7  2  1.0
three  3  6  9  4  9.0
two    2  5  8  3  5.0

In [45]:
df.sort_values('a')

       a  b  c  d    f
e
one    1  4  7  2  1.0
two    2  5  8  3  5.0
three  3  6  9  4  9.0

In [0]:
# from https://www.kaggle.com/austinreese/craigslist-carstrucks-data
# 5000 row sample

In [0]:
vehicles = pd.read_csv('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/craigslist_vehicles_sample.csv')

In [0]:
vehicles.head()

   Unnamed: 0          id  ...      lat      long
0       27187  7089214269  ...  33.6372  -96.6184
1      421279  7077070594  ...  33.7792  -84.4118
2      111869  7093288110  ...  33.5375 -112.1590
3      342219  7089016788  ...  42.3042  -83.7068
4      461726  7091959768  ...  34.2548  -77.8456

[5 rows x 26 columns]

## Exercise:
The "year" column doesn't look right: the values are floats but they should be integers.  Use the "astype()" function to cast the values to 32-bit integers.  You might be tempted to do something like the following, which will result in an error.  Fix the error.

In [0]:
vehicles['year'] = vehicles['year'].astype('int32')

ValueError: ignored

In [0]:
# Solution
vehicles['year'] = vehicles.year.fillna(0).astype('int32')

## Exercise:

What proportion of listings were from the Ann Arbor region?

In [0]:
# Solution
len(vehicles[vehicles['region'] == 'ann arbor'])/len(vehicles)

0.0028

## Exercise:
List the top 3 manufacturers (note: when we say "top N", we typically mean the top N ranked from most common to least common).

In [0]:
# Solution
vehicles.manufacturer.value_counts()

ford               941
chevrolet          702
toyota             377
nissan             291
honda              248
jeep               242
ram                241
gmc                218
dodge              189
bmw                160
subaru             110
hyundai            107
volkswagen          94
mercedes-benz       94
kia                 92
chrysler            72
cadillac            68
lexus               63
buick               60
mazda               55
audi                52
infiniti            47
acura               36
pontiac             33
volvo               33
lincoln             31
mitsubishi          31
mercury             23
rover               16
mini                16
saturn              12
fiat                11
jaguar               6
harley-davidson      2
tesla                2
datsun               1
ferrari              1
Name: manufacturer, dtype: int64

In [0]:
vehicles.head(10)

   Unnamed: 0          id  ...      lat      long
0       27187  7089214269  ...  33.6372  -96.6184
1      421279  7077070594  ...  33.7792  -84.4118
2      111869  7093288110  ...  33.5375 -112.1590
3      342219  7089016788  ...  42.3042  -83.7068
4      461726  7091959768  ...  34.2548  -77.8456
5      188718  7091352525  ...  40.7060  -73.6190
6      229922  7090189512  ...  41.1259  -81.5080
7      429837  7093276189  ...  40.2502  -75.1776
8      146446  7084560454  ...  45.7281  -94.9682
9       46754  7091354973  ...  42.5374  -96.7441

[10 rows x 26 columns]

In [0]:
vehicles.vin.dropna().map(lambda x:x[0])

1       J
2       1
3       W
6       S
7       2
       ..
4992    1
4995    5
4996    1
4997    W
4999    1
Name: vin, Length: 2911, dtype: object

In [0]:
vehicles.title_status.value_counts()

clean         4772
rebuilt        100
salvage         58
lien            27
missing          8
parts only       2
Name: title_status, dtype: int64

In [0]:
vehicles.cylinders.value_counts()

6 cylinders     1124
4 cylinders      881
8 cylinders      866
5 cylinders       29
10 cylinders      25
other             15
3 cylinders        6
12 cylinders       1
Name: cylinders, dtype: int64

In [0]:
import ee

In [0]:
ee.Authenticate()

To authorize access needed by Earth Engine, open the following URL in a web browser and follow the instructions. If the web browser does not start automatically, please manually browse the URL below.

    https://accounts.google.com/o/oauth2/auth?client_id=517222506229-vsmmajv00ul0bs7p89v5m89qs8eb9359.apps.googleusercontent.com&scope=https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fearthengine+https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdevstorage.full_control&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&response_type=code&code_challenge=uJaQq4wDvDzGSPs1nCMyrTe5i5QaWBnb63o914GETVo&code_challenge_method=S256

The authorization workflow will generate a code, which you should paste in the box below.
Enter verification code: 4/ygH_UZvBcfYlXXX6Mps443KoTAn2To4V9sH1blCJxkbDgLULh5hBG30

Successfully saved authorization token.

In [0]:
ee.Initialize()

EEException: ignored